
set_property PACKAGE_PIN AD26 [get_ports SFP1_RX_LOS]
set_property IOSTANDARD LVCMOS25 [get_ports SFP1_RX_LOS]
set_property PACKAGE_PIN AF24 [get_ports SFP1_TX_DISABLE]
set_property IOSTANDARD LVCMOS25 [get_ports SFP1_TX_DISABLE]

#set_property PACKAGE_PIN AE23 [get_ports SFP2_TX_DISABLE]
#set_property IOSTANDARD LVCMOS25 [get_ports SFP2_TX_DISABLE]
#set_property PACKAGE_PIN AD25 [get_ports SFP2_RX_LOS]
#set_property IOSTANDARD LVCMOS25 [get_ports SFP2_RX_LOS]

set_property PACKAGE_PIN E11 [get_ports PHY1_RX_CLK]
set_property PACKAGE_PIN A10 [get_ports {PHY1_RX_D[0]}]
set_property PACKAGE_PIN B10 [get_ports {PHY1_RX_D[1]}]
set_property PACKAGE_PIN B11 [get_ports {PHY1_RX_D[2]}]
set_property PACKAGE_PIN C11 [get_ports {PHY1_RX_D[3]}]
set_property PACKAGE_PIN H8 [get_ports {PHY1_TX_D[0]}]
set_property PACKAGE_PIN H9 [get_ports {PHY1_TX_D[1]}]
set_property PACKAGE_PIN J9 [get_ports {PHY1_TX_D[2]}]
set_property PACKAGE_PIN J10 [get_ports {PHY1_TX_D[3]}]
set_property PACKAGE_PIN G9 [get_ports PHY1_TX_CTRL]
set_property PACKAGE_PIN D11 [get_ports PHY1_RX_CTRL]
set_property PACKAGE_PIN D9 [get_ports {PHY1_RESETN[0]}]
set_property PACKAGE_PIN C8 [get_ports PHY1_MDIO]
set_property PACKAGE_PIN C9 [get_ports PHY1_MDC]
set_property PACKAGE_PIN G10 [get_ports PHY1_GTX_CLK]
set_property IOSTANDARD LVCMOS18 [get_ports PHY1_GTX_CLK]
set_property IOSTANDARD LVCMOS18 [get_ports PHY1_MDIO]
set_property IOSTANDARD LVCMOS18 [get_ports PHY1_MDC]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY1_RESETN[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports PHY1_RX_CTRL]
set_property IOSTANDARD LVCMOS18 [get_ports PHY1_TX_CTRL]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY1_TX_D[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY1_TX_D[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY1_TX_D[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY1_TX_D[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY1_RX_D[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY1_RX_D[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY1_RX_D[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY1_RX_D[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports PHY1_RX_CLK]

set_property PACKAGE_PIN E13 [get_ports PHY2_RX_CLK]
set_property PACKAGE_PIN A14 [get_ports {PHY2_RX_D[0]}]
set_property PACKAGE_PIN B14 [get_ports {PHY2_RX_D[1]}]
set_property PACKAGE_PIN A15 [get_ports {PHY2_RX_D[2]}]
set_property PACKAGE_PIN B15 [get_ports {PHY2_RX_D[3]}]
set_property PACKAGE_PIN F13 [get_ports {PHY2_TX_D[0]}]
set_property PACKAGE_PIN F14 [get_ports {PHY2_TX_D[1]}]
set_property PACKAGE_PIN F15 [get_ports {PHY2_TX_D[2]}]
set_property PACKAGE_PIN H14 [get_ports {PHY2_TX_D[3]}]
set_property PACKAGE_PIN G14 [get_ports PHY2_TX_CTRL]
set_property PACKAGE_PIN E12 [get_ports PHY2_RX_CTRL]
set_property PACKAGE_PIN E15 [get_ports {PHY2_RESETN[0]}]
set_property PACKAGE_PIN C14 [get_ports PHY2_MDIO]
set_property PACKAGE_PIN D14 [get_ports PHY2_MDC]
set_property PACKAGE_PIN G15 [get_ports PHY2_GTX_CLK]
set_property IOSTANDARD LVCMOS18 [get_ports PHY2_GTX_CLK]
set_property IOSTANDARD LVCMOS18 [get_ports PHY2_MDIO]
set_property IOSTANDARD LVCMOS18 [get_ports PHY2_MDC]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY2_RESETN[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports PHY2_RX_CTRL]
set_property IOSTANDARD LVCMOS18 [get_ports PHY2_TX_CTRL]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY2_TX_D[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY2_TX_D[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY2_TX_D[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY2_TX_D[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY2_RX_D[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY2_RX_D[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY2_RX_D[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {PHY2_RX_D[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports PHY2_RX_CLK]

#set_property PACKAGE_PIN D16 [get_ports {LED[0]}]
#set_property PACKAGE_PIN G16 [get_ports {LED[1]}]
#set_property PACKAGE_PIN H16 [get_ports {LED[2]}]
#set_property PACKAGE_PIN E18 [get_ports {LED[3]}]
#set_property PACKAGE_PIN E17 [get_ports {LED[4]}]
#set_property PACKAGE_PIN E16 [get_ports {LED[5]}]
#set_property PACKAGE_PIN H18 [get_ports {LED[6]}]
#set_property PACKAGE_PIN H17 [get_ports {LED[7]}]
#set_property IOSTANDARD LVCMOS18 [get_ports {LED[*]}]

set_property PACKAGE_PIN D16 [get_ports DEBUG_CLK]
set_property IOSTANDARD LVCMOS18 [get_ports DEBUG_CLK]


set_property BITSTREAM.GENERAL.COMPRESS TRUE [current_design]
set_property BITSTREAM.CONFIG.CONFIGRATE 50 [current_design]
set_property BITSTREAM.CONFIG.SPI_BUSWIDTH 4 [current_design]

#create_clock -period 8.000 -name PHY1_RX_CLK -waveform {0.000 4.000} [get_ports PHY1_RX_CLK]

#set_input_delay -clock PHY1_RX_CLK -max 4.0 [get_ports {PHY1_RX_D[*]}]
#set_input_delay -clock PHY1_RX_CLK -max 4.0 [get_ports {PHY1_RX_CTRL}]
#set_input_delay -clock PHY1_RX_CLK -min 3.5 [get_ports {PHY1_RX_D[*]}]
#set_input_delay -clock PHY1_RX_CLK -min 3.5 [get_ports {PHY1_RX_CTRL}]
#set_input_delay -clock PHY1_RX_CLK -clock_fall -max 4.0 [get_ports {PHY1_RX_D[*]}] -add
#set_input_delay -clock PHY1_RX_CLK -clock_fall -max 4.0 [get_ports {PHY1_RX_CTRL}] -add
#set_input_delay -clock PHY1_RX_CLK -clock_fall -min 3.5 [get_ports {PHY1_RX_D[*]}] -add
#set_input_delay -clock PHY1_RX_CLK -clock_fall -min 3.5 [get_ports {PHY1_RX_CTRL}] -add

#set_output_delay -clock clk_125_design_gmii_test_clk_wiz_0_0 -max -3.0 [get_ports {PHY1_TX_D[*]}]
#set_output_delay -clock clk_125_design_gmii_test_clk_wiz_0_0 -max -3.0 [get_ports {PHY1_TX_CTRL}]
#set_output_delay -clock clk_125_design_gmii_test_clk_wiz_0_0 -min 0.0 [get_ports {PHY1_TX_D[*]}]
#set_output_delay -clock clk_125_design_gmii_test_clk_wiz_0_0 -min 0.0 [get_ports {PHY1_TX_CTRL}]
#set_output_delay -clock clk_125_design_gmii_test_clk_wiz_0_0 -clock_fall -max -3.0 [get_ports {PHY1_TX_D[*]}] -add
#set_output_delay -clock clk_125_design_gmii_test_clk_wiz_0_0 -clock_fall -max -3.0 [get_ports {PHY1_TX_CTRL}] -add
#set_output_delay -clock clk_125_design_gmii_test_clk_wiz_0_0 -clock_fall -min 0.1 [get_ports {PHY1_TX_D[*]}] -add
#set_output_delay -clock clk_125_design_gmii_test_clk_wiz_0_0 -clock_fall -min 0.1 [get_ports {PHY1_TX_CTRL}] -add
